{
    "staff_roles": {
        "Resident Assistant": {
            "description": "1 \n \n \n \n \nPOSITI ON DESCR IPTION  \nNorth  Dakota  University System \n \nPART A - Identification, Duties/Respons ibilities, and Task Inventory  \n \n \n   (#’s 1 -12a must match HRMS or left blank and include a Position Request/Change form)  \n \n1. Name of Employee: Mathew Muston   \n1a. EmpID  #: 8013142  \n \n2. Position #:  0001 3639   \n2a. Dept. ID #:  3610   \n2b. Current or Recommended Salary :   $64,500  \n \n3. Band #/Title : 3000: Professional  \n  \n3a. Job Family #/Title: 3415 General Student Services Professional  \n \n4. Functional Title:   Assistant Director  of Housing Operations  \n5. Please check all that apply \n \n5a. Type  of position:   ☒Full time     ☐ Part-time  \nIF Part-Time, FTE Percentage: ______%  \n5b. Length of Position:  ☐  9 month  ☐ 10 month  ☐ 11 month ☒ 12 month  ☐Other Month _____  \n \n6. Institution: University of North  Dakota  \n7. Division:  Student Affair s \n \n8. Department:   Housing  & Residence Life   \n9. Unit: \n \n10. Work Mailing Address: 525 Stanford Road, Grand Forks, ND 58202 -9029   \n11. Work Phone:  701.777. 6366  \n \n12. Name & Title of Supervisor:  Troy Noeldner , Director of Housing  & Residence Life  12a. Supervisor Posn #:   00015789  \n13.  What is the function/mission of your department? \n \nThe Housing Department at the University of North Dakota is a large diverse auxiliary enterprise, whose mission is to deliver ho using \nservices  to the University community in a manner that is congruent with the overall mission of the University.  The department’s goal is \nnot only to meet the needs of a changing student population, but to supplement the academic experience by providing opportuni ties to \nenhance personal growth, develop a positive self -identity an d to interact successfully with others in the college environment.  This \nmission is realized through the careful integration of financial planning, facilities coordination, and development of educat ional student -\noriented programs and services designed to benefit the University community.  The department provides quality services in sup port of \nthe University’s overall mission and is an enthusiastic partner in new campus developments and activities.  The department strives to \nserve as a center of excellence and provide expertise, teamwork, vitality, and innovation for the betterment of the institution.  \n14.  What is the purpose of your position? (Why does the position exist, how does the position function within the work unit?) \n \nReporting to the Director of Housing & Residence Life, the Assistant Director of Housing Operations will provide leadership t o \ndepartmental administrative operations and service delivery. Housing & Residence Life oversees more than 25 residential facil ities \nwhich accommodate approximately 3,000 residential students. As a member of the senior leadership team, the Assistant Director  of \nHousing Operations will work with direct ing the room and apartment assignment processes, move -in/move -out processes, \npolicy/procedure development, housing software initiatives, training/implementation of customer service standards, service ce nter \noperations, mail/package services, housing key manage ment, document retention, assessment, etc. This position will work \ncollaboratively with the Housing staff and contribute to the achievement of departmental goals and priorities.  \n \n15.  Is this position essential during emergencies/closures?     ☐  Yes    ☒   No \n(Essential personnel may be required to work during emergencies and closures affecting UND depe nding on staffing levels required for \nthat particular situation.) \nDocusign Envelope ID: 5BACE92D-4961-41A1-80D8-38189E1D7ACC2 \n PART A - 16.  Duties/Responsibilities \n⇒   Indicate Essential/Secondary.  The following questions should be taken into consideration in the determination: \n- Is the duty/responsibility the reason the job exists? \n-  Is this a highly specialized task or one that requires special education, training, licensure? \nIf the  answer is yes, the duty is “essential”. \n- What is the percentage of time spent on the function? \nIf the  answer ind icates a great % of time, the duty is prob ably “esse ntial”. \n- What are the consequences to others or the institution of a failure to perform the function? \nIf the  answer ind icates a high level of accountability, the duty is “esse ntial”. \n \nNOTE:  See Position Description Instructions and example s. \n \n \nDuty/Responsibility  \nNo.      1 Percent \nof Time  \n30% Statement of duty/responsibility (used for evaluation/review of performance) : \n \n \nOccupancy Management  \nFor ADA c ompliance, see instruction. \nRespo nsibility is:                                         \n☒Essenti al  ☐ Seco ndary \n(Plea se check one) \nTasks involved in fulfilling the above duties/responsibilities (include description for physical and mental/cognitive demands)  \n \n1. Oversee the administration of assignment processes for new and returning students in residence halls and apartments.  \n2. Provide leadership for the department’s housing management software system functions to ensure accuracy and efficiency.   \n3. Coordinate with legal counsel and other housing officials to review all contracts and leases.  \n4. Review, evaluate, and implement  requests for exemptions from housing requirements, assignment changes, and \ncancellation of contracts/leases.  \n5. Coordinate the generation of reports on applications, occupancy, and demographics for internal and external distribution and \nusage as requested.  \n6. Develop and provide oversight of the  comprehensive assignments experience including  marketing and outreach to current \nand prospective residents, application, renewal, assignment, check -in/check -out processes, resident satisfaction and pos t \noccupancy follow up as needed . \n \n \n \n \nDuty/Responsibility  \nNo.      2 Percent \nof Time  \n25% Statement of duty/responsibility (used for evaluation/review of performance) : \n \n \nAdministration  \nFor ADA c ompliance, see instruction. \nRespo nsibility is:                                         \n☒Essenti al  ☐ Seco ndary \n(Plea se check one) \nTasks involved in fulfilling the above duties/responsibilities (include description for physical and mental/cognitive demands)  \n \n1. Communicate regularly with the senior housing leadership regarding duties, assignments,  and responsibilities. Providing \nupdates, seeking clarification or assistance as needed to ensure timely and accurate completion of assigned tasks.  \n2. Demonstrate and apply knowledge of compliance and regulatory requirements related to operations i.e., Fair Housing, \nClery, FERPA, ACA, Title IX, etc.  \n3. Provide oversight of key inventory and Electronic Door Access systems for all on -campus housing facilities year -round  and \nstay informed of new key inventory tracking systems and software.  \n4. Develop and manage processes to meet departmental goal of maximizing use of electronic and on -line service delivery, \nself-service options, recordkeeping, and administrative processes . \n5. Provide leadership for the department’s housing management software system functions. Manage access for new users to \nall Housing software programs; audit processes regularly to ensure access privileges are current and appropriate security \nprotocols are followed to all Housing related software.  \n6. Regularly audit processes and monitor training necessary to safeguard confidentiality and security of records . \n7. Monitor, evaluate and implement changes to operational processes where needed to ensure best practices and high \nstandards of service delivery . \n8. Direct service operations including service centers, desk operations, mail services, etc.  \n9. Assist with planning and execution of opening and closing of all residential units including transition housing, semester \nbreak housing, and summer conferences.  \n10. Annually review polices and propose changes in support of departmental and University goals.  \n11. Propose technology solutions which result in higher operational effectiveness and services to internal and external \ncustomers.  \n \n \n \nDocusign Envelope ID: 5BACE92D-4961-41A1-80D8-38189E1D7ACC3 \n  \n \n \nDuty/Responsibility  \nNo.      3 Percent \nof Time  \n20% Statement of duty/responsibility (used for evaluation/review of performance) : \n \n \nStaffing/Supervision  \nFor ADA c ompliance, see instruction. \nRespo nsibility is:                                         \n☒Essenti al  ☐ Seco ndary \n(Plea se check one) \nTasks involved in fulfilling the above duties/responsibilities (include description for physical and mental/cognitive demands)  \n \n1. Supervise  the recruitment,  selection,  training,  professional development,  and evaluation  of the housing operations  team.  \n2. Ensure training and documentation on application and assignment policies and procedures, and usage of the housing \nmanagement system and other departmental software.  \n3. Ensure Housing end -users receive instruction, information, and training materials for housing management software, \nconduct management software, and other related applications.  \n4. Annually review, update/revise, and execute training programs to remain current and comply with life -safety issues, \nuniversity, and federal guidelines/mand ates.  \n \n \n \n \nDuty/Responsibility  \nNo.      4 Percent \nof Time  \n15% Statement of duty/responsibility (used for evaluation/review of performance) : \n \n \nPublic Relations  \nFor ADA c ompliance, see instruction. \nRespo nsibility is:                                         \n☒Essenti al  ☐ Seco ndary \n(Plea se check one) \nTasks involved in fulfilling the above duties/responsibilities (include description for physical and mental/cognitive demands)  \n \n1. Meet with current and prospective residents as needed to answer questions or resolve issues.  \n2. Work  with supervisor and departmental marketing personnel in communicating important deadlines and related information \nto students, parents,  and other constituents . \n3. Consult with, advise, and interpret University Housing policies and procedures to staff, students, families, and public.  \n4. Greet and maintain high levels of customer services, addressing callers, students, parents, guests, co -workers, and \nUniversity personnel in a friendly and helpful manner . \n5. Follow up with students, parents and others as necessary to resolve assignment related issues . \n6. Maintain working knowledge of campus resources and act as a liaison with other departments and offices.  \n7. Collaborate with other Housing staff members as required, participate as an active and supportive member of the \nDepartment of Housing . \n8. Represent Housing on various campus committees as may be requested or assigned.  \n9. Establish collaborative working relationships with internal and external constituent groups or individuals .  \n10. Maintain professional contacts through ACUHO -I and other professional organizations . \n \n \n \n \nDuty/Responsibility  \nNo.      5 Percent \nof Time  \n5% Statement of duty/responsibility (used for evaluation/review of performance) : \n \n \nBudget and Finance Management  \nFor ADA c ompliance, see instruction. \nRespo nsibility is:                                         \n☒Essenti al  ☐ Seco ndary \n(Plea se check one) \nTasks involved in fulfilling the above duties/responsibilities (include description for physical and mental/cognitive demands ) \n \n1. Develop and make recommendations for budget proposals for housing operation areas (salary, training, programming, \ntravel, etc.) annually prior to rate development (November 1 annually).  \n2. Work with Director of Finance and Facilities to oversee budget expenditures by all staff within housing operations \nareas.  \n \n \nDocusign Envelope ID: 5BACE92D-4961-41A1-80D8-38189E1D7ACC4 \n  \nDuty/Responsibility  \nNo.      6 Percent \nof Time  \n5% Statement of duty/responsibility (used for evaluation/review of performance) : \n \n \nPlanning and Other Duties  \nFor ADA c ompliance, see instruction. \nRespo nsibility is:                                         \n☒Essenti al  ☐ Seco ndary \n(Plea se check one) \nTasks involved in fulfilling the above duties/responsibilities (include description for physical and mental/cognitive demands ) \n \n1. Contribute and collaborate in departmental assessment and planning initiatives.  \n2. Serve as member of Housing Leadership Team and participate in strategic planning process and in establishing short -\nterm, mid -term, and long -term goals.  \n3. Assist in preparation of Housing annual report as requested.  \n4. Perform related duties as directed or required that promote the goals and objectives of the department, Division, and \nUniversity.  \n5. Serve in on -call duty rotation as requested or scheduled.  \n \n \n \n \nPART B – Required Experience, Characteristics and Ability  \n \n1.  EDU CATION/KN OWLEDGE RE QUIRE MENT - Minimu m education required to perform adequ ately in position could reasonably \nbe attained only by completing the following (if you were to recruit today, what qualification would you require?) \nREQUIRED EDUC ATION/TRAINING  (choose one) \n☐ less than high school diploma \n☐ high school diploma or GED \n \nCOLLEGE LEVEL (choose one) \n☐ 1 year ☐ 2 year ☐ 3 year ☐ 4 year \n☐  Associate’s    ☐  Bachelor ’s \n \n \nGRADUA TE LEVEL  (choose one) \n☐ 1 year ☐ 2 year ☒ post-graduate Major field of study or degree emphasis (accounting, economics, etc...) \n \n   Master’s Degree  \n \n \nSpecialized subject knowledge (cost accounting, MACRO economics, etc.) \n   Student Af fairs Administration, Higher Ed, Leadership, Education , Business \nAdministration, Technology, Public Administration,  or related field  \nMinimum Qualifications:  \n• Master’s degree in Higher Education Administration, Student Affairs, Counseling, or related field.  \n• Two years progressively responsible positions in University residential life and housing administration or related \nfield post -master’s degree.  \n• Three+ years of experience in residential life, student affairs, or related field.  \n• Two+ years supervisory experience  \n \n \n \n   ☒  Valid Driver’s License  \n   ☐  Other License(s) or Certification(s) ____________________________________________________________  \nDocusign Envelope ID: 5BACE92D-4961-41A1-80D8-38189E1D7ACC5 \n  \n \n2. RESP ONSIBILITY F OR DIRECT  SUPERVISI ON OF THE F OLLOWING CLASSIFIED POSITIONS \n \nPosition Number  \nJob Family and  Title of Persons Supervised  \nFTE  \n00013632  Assignment Coordinator, Residence Halls  1 \n00015786  Assignment Coordinator, Apartments  1 \n00024671  Complex Secretary  1 \n00015166  Operations Manager  1 \n  \nTOTAL 4 \n3.  INDIRECT  SUPERVISI ON:                             Total number of classified positions indirectly supe rvised:  \n                          Total number of student employees  or other non-classified employees indirectly supervised:  \n Preferred Qualifications : \n \n• Knowledge and experience using housing assignment software management systems in a college setting  \nincluding assignment process, billing, and creating data reports.  \n• Experience supervising and mentoring student staff.  \n• Flexibility to work evenings, weekends, and respond to emergencies as needed.  \n• Previous experience managing complex administrative and/or  technical systems or processes.  \n• Previous experience developing and presenting training materials and programs.  \n• Five+ years  progressively responsible positions in University residential life and housing administration or \nrelated field.  \n \nCompetencies  required: (i.e. ability to…, demonstrated leadership skills, strong communication skills)  \n• Demonstrated experience with process analysis and improvement.  \n• Knowledge and understanding of applicable regulatory requirements (FERPA, Clery Act, Title IX) . \n• Strong time management  and ability to manage m ultiple projects and priorities.  \n• Demonstrated problem solv ing and process analysis skills.  \n• Excellent verbal, written and interpersonal communication skills . \n• Understanding of student development and best practices in residential education.  \n• Ability to work collaboratively in a diverse and inclusive environment.  \n \n \n \nWork s afety requirements:  \n• Follow safety rules  and promote safe behavior  \n• Help identify unsafe working conditions and notify supervisor or Office of Safety  \n• Ensure the safety policies and procedures are being followed  \n• Report incidents and near misses to supervisor or Office of Safety within 24 hours  \n• Complete all required safety and other mandatory training requirements  \n Work habit requirements:  \n• Attendance and punctuality consistently maintained; follows correct procedures for notification  \n• Use work time appropriately for work activities; attend meetings promptly  \n• Demonstrate flexibility in scheduling and accepting work assignments  \n• Follow procedures for requesting leave and reporting absences; provide necessary documentation/releases  \n• Remain calm, professional, and collegial in all circumstances  \nDocusign Envelope ID: 5BACE92D-4961-41A1-80D8-38189E1D7ACC6 \n  \n4. HAZARDOUS WORKING \nCONDITI ONS  \nUnusu al or hazardous working conditions related to performance of duties: \n \nN/A \n  \nPrecautionary measures taken to avoid those unusual or hazardous working conditions: \n \nN/A \n Frequency of occurrence of unusual or hazardous working conditions: \n \nN/A \n \n \n5.  This position is classified as:               ☒   Exempt                    ☐   Non -Exempt  (eligible for overtime)  \n \nExecutive  \n  ☐   Meets FLSA Salary Requirements                 Administrative  \n  ☒    Meets FLSA Salary Requirements                 Professional  \n ☐    Meets FLSA Salary Requirements                 \n☐Primary duty is management of the \nenterprise or recognized department/ \nsubdivision  \n \n☐Does the employee have the authority \nto hire or fire or provide suggestions/ \nrecommendations to hire, fire, promote or \nchange status of other employees  ☒Primary duty is office/non -manual work \nrelated to management policies/general \nbusiness operations  \n \n☐Work directly related to academic \ninstruction or training  ☐Primary duty is work requiring \nknowledge of advanced type in science \nor learning  \n \n☐Work is original and creative in a field \nof artistic endeavor  \n \n☐Work is teaching in educational \ninstitution  \n \n☐Work requires theoretical/practical \napplication of highly specialized \nknowledge in computer systems \nanalysis, programming and software  \nengineering and employee is employed \nand engaged in these activities  \n☐Customarily and regularly directs the \nwork of two or more other employees  ☒Customarily and regularly exercises \ndiscretion and independent judgment  in \nmatters of consequence  ☐Work requires consistent exercise of \ndiscretion and judgment  \nDocusign Envelope ID: 5BACE92D-4961-41A1-80D8-38189E1D7ACC7 \n  \n \n6.  PHYSIC AL JOB RE QUIREMENTS:  Indicate according to essential duties/responsibilities \nEmployee is required to:  \nNever 1-33% \nOccas ionally 34-66% \nFrequently 66-100% \nContinuou sly \n \nStand   X \n  \n \nWalk   X  \n \nSit   X  \n \nUse hands dexterously (use fingers to handle, feel)   X  \n \nReach with hands and arms   X  \n \nClimb or balance   X  \n \nPulling/Tugging /Twisting    X  \n \nStoop/kneel/crouch or crawl  X   \n \nTalk or hear    X \n \nTaste or smell   X  \n \nLift & carry: up to 10 pounds   X  \n \nup to 25 pounds   X  \n \nup to 50 pounds  X   \n \nup to 75 pounds X    \n \nup to 100 pounds X    \n \nmore than 100 pounds X    \nOther ( Please Explain ):  \n \n \n \nMy signature below indicates I have read and understand the  description of the duties and responsibilities assigned to the \nposition.  I also understand that my supervisor and the institution have  the right to make changes to duties and work \nschedule to meet business needs.  \n \n \n \n \nEmplo yee's Signature Date \n \n \n \n \n \nSupervisor's Signature Date \n \nPLEASE ATTACH A BLACK AND WHITE ORGANIZATIONAL CHART \n \nLast updated 04/20 /2017  \nDocusign Envelope ID: 5BACE92D-4961-41A1-80D8-38189E1D7ACC\n2/3/2025\n2/3/2025\n",
            "system_instruction": "You are a practice partner for a Resident Assistant. Evaluate responses based on their job description and the Guiding North Framework."
        },
        "Resident Director": {
            "description": "1 \n \n \n \n \nPOSITI ON DESCR IPTION  \nNorth  Dakota  University System \n \nPART A - Identification, Duties/Respons ibilities, and Task Inventory  \n \n \n   (#’s 1 -12a must match HRMS or left blank and include a Position Request/Change form)  \n \n1. Name of Employee: Sophia Galvan   \n1a.EmplID #: 8013921  \n \n2. Position #: 00015733   \n2a. Dept. ID #: 3610   \n2b. Current or Recommended Salary :  $43,888  \n \n3. Band #/Title : 3000: Professional  \n  \n3a. Job Family #/Title: 3415 General Student Services Professional  \n \n4. Functional Title:  Resident Director  \n5. Please check all that apply \n \n5a.Type of position: ☒Full time     ☐ Part-time  \nIF Part-Time, FTE Percentage: ______%  \n5b. Length of Position:  ☐  9 month  ☐ 10 month  ☐ 11 month ☒ 12 month  ☐Other Month _____  \n \n6. Institution: University of North  Dakota  \n7. Division:  Student Affairs & Diversity  \n \n8. Department:  Housing & Residence Life   \n9. Unit:  Residence Life  \n \n10. Work Mailing Address:  PO Box 9029   \n11. Work Phone:  777-4251  \n \n12. Name & Title of Supervisor:  Shannon Jolley , Assoc iate Director, Residence Life  12a. Supervisor Posn # :   00016043  \n13.  What is the function/mission of your department? \n \nThe Department of Housing & Residence Life at the University of North Dakota is a large diverse auxiliary enterprise, whose mission is to \ndeliver housing services to the University community in a manner that is congruent with the overall mission of the University .  The \ndepartment’s goal is not only to meet the needs of a changing student population, but to supplement the academic experience by \nproviding opportunities to enhance personal growth, develop a positive self -identity and to interact successfully with others in the college \nenvironment.  This mission is realized through the careful integration  of financial planning, facilities coordination, and development of \neducational student -oriented programs and services designed to benefit the University community.  The department provides quality \nservices in support of the University’s overall mission an d is an enthusiastic partner in new campus developments and activities.  The \ndepartment strives to serve as a center of excellence and provide expertise, teamwork, vitality and innovation for the better ment of the \ninstitution.  \n \n14.  What is the purpose of your position? (Why does the position exist, how does the position function within the work unit?) \nReporting to the Associate Director of Residence Life, Resident  Directors ( RDs) will assume a visible leadership role in the \ndevelopment of positive residential communities serving approximately 300 -800 single student housing residents in 2 -3 buildings.  \nResident  Directors are expected to provide effective supervision of 1 Community Assistant and approximately  10-20 Resident \nAssistants.  The Resident  Director is responsible for the day -to-day management and delivery of student -centered services including: \nsupervision, learning outcome - based programming, building security, faciliti es management, budget management, student conduct \nprocesses, emergency response and general administrative duties.  Resident Directors interpret and administer university policies, to \nensure community standards are met.  As full -time live in positions, Resident  Directors provide primary on -call support and emergency \nresponse.  Resident  Directors are expected to engage in collaborative working relationships with other Housing staff as well as other \ncampus departments.  This position requires work outside the  normal office hours as necessary to support community development, \nstaff training and professional development of student leade rs and staff.    \nResident  Directors are responsible for administering one or more rotating collateral projects or programs in support of departmental \ngoals.  Examples include but may not be limited to:  assisting with residence life staff hiring, training and development ; summer \nconferences ; advising  student leadership  groups  (ARH/NRHH) ; the residential curriculum and /or living/learning communities.  \n \n15.  Is this position essential during emergencies/closures?     ☒  Yes    ☐   No \n(Essential personnel may be required to work during emergencies and closures affecting UND depe nding on staffing levels required for \nthat particular situation.) \nDocusign Envelope ID: 3EBF9925-81ED-4A91-9528-4DF83F46784F2 \n PART A - 16.  Duties/Responsibilities \n⇒   Indicate Essential/Secondary.  The following questions should be taken into consideration in the determination: \n- Is the duty/responsibility the reason the job exists? \n-  Is this a highly specialized task or one that requires special education, training, licensure? \nIf the  answer is yes, the duty is “essential”. \n- What is the percentage of time spent on the function? \nIf the  answer ind icates a great % of time, the duty is prob ably “esse ntial”. \n- What are the consequences to others or the institution of a failure to perform the function? \nIf the  answer ind icates a high level of accountability, the duty is “esse ntial”. \n \nNOTE:  See Position Description Instructions and example s. \n \n \nDuty/Responsibility  \nNo. 1       Percent \nof Time  \n30% Statement of duty/responsibility (used for evaluation/review of performance) : \n \nCOMMUNITY AND STUDENT DEVELOPMENT :  Through the formation of positive \ncommunities, that encourage personal growth and development , students will gain a \nbetter sense of their identity. We believe that individual growth is strengthened through \nan understanding of the individual as part of a community. Facilitating student \ndevelopment through community development enables students to ga in an identity \nbased on their involvement in the community. This will encourage student interaction \nand will reinforce the importance of individual involvement in communities.  \n For ADA c ompliance, see instruction. \nRespo nsibility is:                                         \n☒Essenti al  ☐ Seco ndary \n(Plea se check one) \nTasks involved in fulfilling the above duties/responsibilities (include description for physical and mental/cognitive \ndemands)  \n \n• Work with students and residence hall staff members to develop environments which teach students skills in responsible \ncommunity living and the appreciation of individual differences.  \n• Create an academic environment conducive to living -learning and scholarly pursuits (e.g. living -learning communities, \nfaculty interaction, and student success programming).  \n• Be aware of student problems and concerns and refer students to appropriate campus resources.  \n• Assist and motivate students and residence hall staff members to plan and initiate student learning oriented programs \nfollowing a Residential Curriculum in the residence hall.  \n• Assist and advise the Residence Hall Government in conjunction with the Community Assistant.  \n• Work with Associate Director/Assistant Director in collaborative programming with campus partners.  \n \n \n \nDuty/Responsibility  \nNo. 2      Percent \nof Time  \n30% Statement of duty/responsibility (used for evaluation/review of performance) : \n \nSTAFFING:    \nFor ADA c ompliance, see instruction. \nRespo nsibility is:                                         \n☒Essenti al  ☐ Seco ndary \n(Plea se check one) \nTasks involved in fulfilling the above duties/responsibilities (include description for physical and mental/cognitive \ndemands):  \n \n• Select, supervise, train, and evaluate a community assistant, resident assistants and student support personnel.  \n• Meet bi -weekly with resident assistant staff and weekly with community assistant.  \n• Conduct weekly area meetings.  \n• Assist in the development of staff manuals, educational materials, training programs, and procedures.  \n• During the academic year supervise and evaluate one or more Community Assistant(s) and area staff of Resident \nAssistants.  \n• Assume leadership for a specific collateral assignment (e.g. Professional Staff Development, Living Learning \nCommunities, RA Selection, RA Training, Residential Curriculum, etc.).  \n \n \n \n \nDocusign Envelope ID: 3EBF9925-81ED-4A91-9528-4DF83F46784F3 \n  \n \n \nDuty/Responsibility  \nNo. 3       Percent \nof Time  \n20% Statement of duty/responsibility (used for evaluation/review of performance) : \n \nBEHAVIOR, FACILITY AND SAFETY MANAGEMENT :  The Resident Director will \nsupervise the personal wellness of residents, use resources responsibly, be innovated \nin use of and sustainability of resources within the hall s as much  as possible.  For ADA c ompliance, see instruction. \nRespo nsibility is:                                         \n☒Essenti al  ☐ Seco ndary \n(Plea se check one) \nTasks involved in fulfilling the above duties/responsibilities (include description for physical and mental/cognitive \ndemands) : \n \n• Interpret and uphold University rules, regulations, and policies:  \no Conduct informal resolution conferences with students involved in alleged violations and initiate referrals to the \ncampus  judicial system as appropriate.  \no Conduct judicial hearings as assigned by the Office of Student Rights and Responsibilities.  \n• Provide leadership for safety and security programs and its policies and procedures in the assigned residence halls.  \n• Assume on -call responsibility for the residence halls on a rotating basis.   \n• Educate residents on emergency and severe weather procedures  \n• Maintain knowledge of location and operations of emergency shut -offs for mechanical/safety systems  \n• Conduct regular fire and other emergency drills and ensure resident compliance with established safety procedures  \n• Follow safety rules, help identify unsafe working conditions and uphold standards of safe working and living environments  \n• Develop positive working relationships with maintenance and custodial personnel to facilitate the overall functioning of the \nresidence hall.  \n• Working knowledge of nondiscrimination laws and compliance regulations including Title IX, due process protections as \nthey apply to Student Conduct proceedings, the Clery Act,  and FERPA.  \n \n \n \n \n \nDuty/Responsibility  \nNo. 4       Percent \nof Time  \n20% Statement of duty/responsibility (used for evaluation/review of performance) : \n \nADMINISTRATIVE : The Resident Director will oversee all of the administrative \nfunctions of the hall s, and make sure that policies are in place to ensure that the \nadministrative functions of the residence hall s run smoothly  For ADA c ompliance, see instruction. \nRespo nsibility is:                                         \n☒Essenti al  ☐ Seco ndary \n(Plea se check one) \nTasks involved in fulfilling the above duties/responsibilities (include description for physical and mental/cognitive \ndemands) : \n \n• Supervise and perform the administrative responsibilities of a residence hall, including openings and closings, staffing the \nresidence hall office at designated hours each day, maintaining accountability for funds allocated by the Associate Director \nfor ha ll programming, staff appreciation, and office supplies.  \n• Maintain all required housing records (including key audits , occupancy reports, etc. ) in cooperation with the Associate \nDirector for Operations and staff.  \n• Maintain the residence hall by promptly and accurately preparing all necessary reports, records, and requests. Refer any \nunsatisfactory maintenance, custodial or health conditions as appropriate.  \n• During the summer term assume leadership for specific assignments and projects related to the Housing and Residence \nLife program or the Division of Student Affairs. Specific projects and summer assignments will be identified in the spring \nsemester and assi gned to each Resident Director.  \n• Participate in committees supporting the Office of Housing and Residence Life and the Division of Student Affairs as \nassigned.  \n• Assist in the performance of central office and other Housing and Residence Life duties as assigned.  \n \n \n \n \n \n \n \n \n \n \n \nDocusign Envelope ID: 3EBF9925-81ED-4A91-9528-4DF83F46784F4 \n  \nPART B – Required Experience, \nCharacteristics and Ability  \n \n1.  EDUCATION/KN OWLEDGE RE QUIRE MENT - Minimu m education required to perform adequ ately in position could reasonably \nbe attained only by completing the following (if you were to recruit today, what qualification would you require?) \nREQUIRED EDUC ATION/TRAINING  (choose one) \n☐ less than high school diploma \n☐ high school diploma or GED \n \nCOLLEGE LEVEL  (choose one) \n☐ 1 year ☐ 2 year ☐ 3 year ☐ 4 year \n☐  Associate’s    ☒  Bachelor ’s \n \n \nGRADUA TE LEVEL   (choose one) \n☐ 1 year ☐ 2 year ☐ post-graduate Major field of study or degree emphasis (accounting, economics, etc...) \n \n \nSpecialized subject knowledge (cost accounting, MACRO economics, etc.) \nMinimum Qualifications:  \n• Bachelor’s degree  \n• Undergraduate or graduate experience in a related position serving university students (Housing & Residence Life, Student \nActivities, Student Government, Judicial Affairs, Resident Assistant, etc.)  \n• Must demonstrate leadership, management and supervisory skills, and be able to communicate effectively and \nprofessionally with students, staff, parents and other constituents  \n• Experience with MS Word, Excel and Microsoft Outlook  \n• Must submit a cover letter specific to this position and resume  \n• Successful completion of a criminal history background check  \n \n   ☒  Valid Driver’s License  \n   ☐  Other License(s) or Certification(s) ____________________________________________________________  \nPreferred Qualifications : \n• 1-2 years prior live -in Residence Life/University Housing experience  \n• 1-2 years prior experience supervising residence life staff and/or advising Residence Hall Association and/or student \norganization(s) or related activity  \n• 1-2 years  of supervisory and management experience with administrative operations including basic budgeting, \nadministrative process and facilities management  \n• 1-2 years of experience with crisis or emergency response/on call  \nCompetencies  required: (i.e. ability to…, demonstrated leadership skills, strong communication skills)  \n• Demonstrated ability to effectively manage time and multiple task and priorities  \n• Ability to work outside of routine business hours, including week -ends and holidays  \n• Excellent organizational and prioritization skills  \n• Demonstrated ability to work in a team setting.  \nDocusign Envelope ID: 3EBF9925-81ED-4A91-9528-4DF83F46784F5 \n  \n \n \n \n2. RESP ONSIBILITY F OR DIRECT  SUPERVISI ON OF THE F OLLOWING CLASSIFIED POSITIONS \n \nPosition Number  \nJob Family and  Title of Persons Supervised  \nFTE  \n   \n   \n   \n   \n  \nTOTAL 0 \n3.  INDIRECT  SUPERVISI ON:                             Total number of classified positions indirectly supe rvised:  \n                          Total number of student employees  or other non-classified employees indirectly supervised: \n 10-20 \n \n \n4. HAZARDOUS WORKING \nCONDITI ONS  \nUnusu al or hazardous working conditions related to performance of duties: \n  \nPrecautionary measures taken to avoid those unusual or hazardous working conditions: \n Frequency of occurrence of unusual or hazardous working conditions: \n \n \n \n \n \n \n Work s afety requirements:  \n• Follow safety rules  and promote safe behavior  \n• Help identify unsafe working conditions and notify supervisor or Office of Safety  \n• Ensure the safety policies and procedures are being followed  \n• Report incidents and near misses to supervisor or Office of Safety within 24 hours  \n• Complete all required safety and other mandatory training requirements  \n Work habit requirements:  \n• Attendance and punctuality consistently maintained; follows correct procedures for notification  \n• Use work time appropriately for work activities; attend meetings promptly  \n• Demonstrate flexibility in scheduling and accepting work assignments  \n• Follow procedures for requesting leave and reporting absences; provide necessary documentation/releases  \n• Remain calm, professional, and collegial in all circumstances  \nDocusign Envelope ID: 3EBF9925-81ED-4A91-9528-4DF83F46784F6 \n 5.  This position is classified as:               ☒   Exempt                    ☐   Non -Exempt  (eligible for overtime)  \n \nExecutive  \n  ☐   Meets FLSA Salary Requirements                 Administrative  \n  ☒    Meets FLSA Salary Requirements                 Professional  \n ☐    Meets FLSA Salary Requirements                 \n☐Primary duty is management of the \nenterprise or recognized department/ \nsubdivision  \n \n☐Does the employee have the authority \nto hire or fire or provide suggestions/ \nrecommendations to hire, fire, promote or \nchange status of other employees  ☒Primary duty is office/non -manual work \nrelated to management policies/general \nbusiness operations  \n \n☐Work directly related to academic \ninstruction or training  ☐Primary duty is work requiring \nknowledge of advanced type in science \nor learning  \n \n• Work is original and creative in a field \nof artistic endeavor  \n \n• Work is teaching in educational \ninstitution  \n \n• Work requires theoretical/practical \napplication of highly specialized \nknowledge in computer systems \nanalysis, programming and software  \nengineering and employee is employed \nand engaged in these activities  \n• Customarily and regularly directs the \nwork of two or more other employees  ☒Customarily and regularly exercises \ndiscretion and independent judgment  in \nmatters of consequence  • Work requires consistent exercise of \ndiscretion and judgment  \nDocusign Envelope ID: 3EBF9925-81ED-4A91-9528-4DF83F46784F7 \n  \n \n6.  PHYSIC AL JOB RE QUIREMENTS:  Indicate according to essential duties/responsibilities \nEmployee is required to:  \nNever 1-33% \nOccas ionally 34-66% \nFrequently 66-100% \nContinuou sly \n \nStand   X  \n \nWalk   X  \n \nSit   X  \n \nUse hands dexterously (use fingers to handle, feel)    X \n \nReach with hands and arms  X   \n \nClimb or balance  X   \n \nPulling/Tugging /Twisting   X   \n \nStoop/kneel/crouch or crawl  X   \n \nTalk or hear    X \n \nTaste or smell  X   \n \nLift & carry: up to 10 pounds   X  \n \nup to 25 pounds  X   \n \nup to 50 pounds  X   \n \nup to 75 pounds X    \n \nup to 100 pounds X    \n \nmore than 100 pounds X    \nOther ( Please Explain ):  \n \n \n \nMy signature below indicates I have read and understand the  description of the duties and responsibilities assigned to the \nposition.  I also understand that my supervisor and the institution has the right to make changes to duties and work \nschedule to meet business needs.  \n \n \n \n \nEmplo yee's Signature Date \n \n \n \n \n \nSupervisor's Signature Date \n \nPLEASE ATTACH A BLACK AND WHITE ORGANIZATIONAL CHART \n \nLast updated 04/20 /2017  \nDocusign Envelope ID: 3EBF9925-81ED-4A91-9528-4DF83F46784F\n1/26/2026\n1/26/2026\n",
            "system_instruction": "You are a practice partner for a Resident Director. Evaluate responses based on their job description and the Guiding North Framework."
        },
        "Director of Housing & Residence Life": {
            "description": "Please upload a PDF job description.",
            "system_instruction": "You are a practice partner for a Director of Housing & Residence Life. Evaluate responses based on their job description and the Guiding North Framework."
        },
        "Associate Director of Residence Life": {
            "description": "Please upload a PDF job description.",
            "system_instruction": "You are a practice partner for a Associate Director of Residence Life. Evaluate responses based on their job description and the Guiding North Framework."
        },
        "Assistant Director of Operations": {
            "description": "1 \n \n \n \n \nPOSITI ON DESCR IPTION  \nNorth  Dakota  University System \n \nPART A - Identification, Duties/Respons ibilities, and Task Inventory  \n \n \n   (#’s 1 -12a must match HRMS or left blank and include a Position Request/Change form)  \n \n1. Name of Employee: Mathew Muston   \n1a. EmpID  #: 8013142  \n \n2. Position #:  0001 3639   \n2a. Dept. ID #:  3610   \n2b. Current or Recommended Salary :   $64,500  \n \n3. Band #/Title : 3000: Professional  \n  \n3a. Job Family #/Title: 3415 General Student Services Professional  \n \n4. Functional Title:   Assistant Director  of Housing Operations  \n5. Please check all that apply \n \n5a. Type  of position:   ☒Full time     ☐ Part-time  \nIF Part-Time, FTE Percentage: ______%  \n5b. Length of Position:  ☐  9 month  ☐ 10 month  ☐ 11 month ☒ 12 month  ☐Other Month _____  \n \n6. Institution: University of North  Dakota  \n7. Division:  Student Affair s \n \n8. Department:   Housing  & Residence Life   \n9. Unit: \n \n10. Work Mailing Address: 525 Stanford Road, Grand Forks, ND 58202 -9029   \n11. Work Phone:  701.777. 6366  \n \n12. Name & Title of Supervisor:  Troy Noeldner , Director of Housing  & Residence Life  12a. Supervisor Posn #:   00015789  \n13.  What is the function/mission of your department? \n \nThe Housing Department at the University of North Dakota is a large diverse auxiliary enterprise, whose mission is to deliver ho using \nservices  to the University community in a manner that is congruent with the overall mission of the University.  The department’s goal is \nnot only to meet the needs of a changing student population, but to supplement the academic experience by providing opportuni ties to \nenhance personal growth, develop a positive self -identity an d to interact successfully with others in the college environment.  This \nmission is realized through the careful integration of financial planning, facilities coordination, and development of educat ional student -\noriented programs and services designed to benefit the University community.  The department provides quality services in sup port of \nthe University’s overall mission and is an enthusiastic partner in new campus developments and activities.  The department strives to \nserve as a center of excellence and provide expertise, teamwork, vitality, and innovation for the betterment of the institution.  \n14.  What is the purpose of your position? (Why does the position exist, how does the position function within the work unit?) \n \nReporting to the Director of Housing & Residence Life, the Assistant Director of Housing Operations will provide leadership t o \ndepartmental administrative operations and service delivery. Housing & Residence Life oversees more than 25 residential facil ities \nwhich accommodate approximately 3,000 residential students. As a member of the senior leadership team, the Assistant Director  of \nHousing Operations will work with direct ing the room and apartment assignment processes, move -in/move -out processes, \npolicy/procedure development, housing software initiatives, training/implementation of customer service standards, service ce nter \noperations, mail/package services, housing key manage ment, document retention, assessment, etc. This position will work \ncollaboratively with the Housing staff and contribute to the achievement of departmental goals and priorities.  \n \n15.  Is this position essential during emergencies/closures?     ☐  Yes    ☒   No \n(Essential personnel may be required to work during emergencies and closures affecting UND depe nding on staffing levels required for \nthat particular situation.) \nDocusign Envelope ID: 5BACE92D-4961-41A1-80D8-38189E1D7ACC2 \n PART A - 16.  Duties/Responsibilities \n⇒   Indicate Essential/Secondary.  The following questions should be taken into consideration in the determination: \n- Is the duty/responsibility the reason the job exists? \n-  Is this a highly specialized task or one that requires special education, training, licensure? \nIf the  answer is yes, the duty is “essential”. \n- What is the percentage of time spent on the function? \nIf the  answer ind icates a great % of time, the duty is prob ably “esse ntial”. \n- What are the consequences to others or the institution of a failure to perform the function? \nIf the  answer ind icates a high level of accountability, the duty is “esse ntial”. \n \nNOTE:  See Position Description Instructions and example s. \n \n \nDuty/Responsibility  \nNo.      1 Percent \nof Time  \n30% Statement of duty/responsibility (used for evaluation/review of performance) : \n \n \nOccupancy Management  \nFor ADA c ompliance, see instruction. \nRespo nsibility is:                                         \n☒Essenti al  ☐ Seco ndary \n(Plea se check one) \nTasks involved in fulfilling the above duties/responsibilities (include description for physical and mental/cognitive demands)  \n \n1. Oversee the administration of assignment processes for new and returning students in residence halls and apartments.  \n2. Provide leadership for the department’s housing management software system functions to ensure accuracy and efficiency.   \n3. Coordinate with legal counsel and other housing officials to review all contracts and leases.  \n4. Review, evaluate, and implement  requests for exemptions from housing requirements, assignment changes, and \ncancellation of contracts/leases.  \n5. Coordinate the generation of reports on applications, occupancy, and demographics for internal and external distribution and \nusage as requested.  \n6. Develop and provide oversight of the  comprehensive assignments experience including  marketing and outreach to current \nand prospective residents, application, renewal, assignment, check -in/check -out processes, resident satisfaction and pos t \noccupancy follow up as needed . \n \n \n \n \nDuty/Responsibility  \nNo.      2 Percent \nof Time  \n25% Statement of duty/responsibility (used for evaluation/review of performance) : \n \n \nAdministration  \nFor ADA c ompliance, see instruction. \nRespo nsibility is:                                         \n☒Essenti al  ☐ Seco ndary \n(Plea se check one) \nTasks involved in fulfilling the above duties/responsibilities (include description for physical and mental/cognitive demands)  \n \n1. Communicate regularly with the senior housing leadership regarding duties, assignments,  and responsibilities. Providing \nupdates, seeking clarification or assistance as needed to ensure timely and accurate completion of assigned tasks.  \n2. Demonstrate and apply knowledge of compliance and regulatory requirements related to operations i.e., Fair Housing, \nClery, FERPA, ACA, Title IX, etc.  \n3. Provide oversight of key inventory and Electronic Door Access systems for all on -campus housing facilities year -round  and \nstay informed of new key inventory tracking systems and software.  \n4. Develop and manage processes to meet departmental goal of maximizing use of electronic and on -line service delivery, \nself-service options, recordkeeping, and administrative processes . \n5. Provide leadership for the department’s housing management software system functions. Manage access for new users to \nall Housing software programs; audit processes regularly to ensure access privileges are current and appropriate security \nprotocols are followed to all Housing related software.  \n6. Regularly audit processes and monitor training necessary to safeguard confidentiality and security of records . \n7. Monitor, evaluate and implement changes to operational processes where needed to ensure best practices and high \nstandards of service delivery . \n8. Direct service operations including service centers, desk operations, mail services, etc.  \n9. Assist with planning and execution of opening and closing of all residential units including transition housing, semester \nbreak housing, and summer conferences.  \n10. Annually review polices and propose changes in support of departmental and University goals.  \n11. Propose technology solutions which result in higher operational effectiveness and services to internal and external \ncustomers.  \n \n \n \nDocusign Envelope ID: 5BACE92D-4961-41A1-80D8-38189E1D7ACC3 \n  \n \n \nDuty/Responsibility  \nNo.      3 Percent \nof Time  \n20% Statement of duty/responsibility (used for evaluation/review of performance) : \n \n \nStaffing/Supervision  \nFor ADA c ompliance, see instruction. \nRespo nsibility is:                                         \n☒Essenti al  ☐ Seco ndary \n(Plea se check one) \nTasks involved in fulfilling the above duties/responsibilities (include description for physical and mental/cognitive demands)  \n \n1. Supervise  the recruitment,  selection,  training,  professional development,  and evaluation  of the housing operations  team.  \n2. Ensure training and documentation on application and assignment policies and procedures, and usage of the housing \nmanagement system and other departmental software.  \n3. Ensure Housing end -users receive instruction, information, and training materials for housing management software, \nconduct management software, and other related applications.  \n4. Annually review, update/revise, and execute training programs to remain current and comply with life -safety issues, \nuniversity, and federal guidelines/mand ates.  \n \n \n \n \nDuty/Responsibility  \nNo.      4 Percent \nof Time  \n15% Statement of duty/responsibility (used for evaluation/review of performance) : \n \n \nPublic Relations  \nFor ADA c ompliance, see instruction. \nRespo nsibility is:                                         \n☒Essenti al  ☐ Seco ndary \n(Plea se check one) \nTasks involved in fulfilling the above duties/responsibilities (include description for physical and mental/cognitive demands)  \n \n1. Meet with current and prospective residents as needed to answer questions or resolve issues.  \n2. Work  with supervisor and departmental marketing personnel in communicating important deadlines and related information \nto students, parents,  and other constituents . \n3. Consult with, advise, and interpret University Housing policies and procedures to staff, students, families, and public.  \n4. Greet and maintain high levels of customer services, addressing callers, students, parents, guests, co -workers, and \nUniversity personnel in a friendly and helpful manner . \n5. Follow up with students, parents and others as necessary to resolve assignment related issues . \n6. Maintain working knowledge of campus resources and act as a liaison with other departments and offices.  \n7. Collaborate with other Housing staff members as required, participate as an active and supportive member of the \nDepartment of Housing . \n8. Represent Housing on various campus committees as may be requested or assigned.  \n9. Establish collaborative working relationships with internal and external constituent groups or individuals .  \n10. Maintain professional contacts through ACUHO -I and other professional organizations . \n \n \n \n \nDuty/Responsibility  \nNo.      5 Percent \nof Time  \n5% Statement of duty/responsibility (used for evaluation/review of performance) : \n \n \nBudget and Finance Management  \nFor ADA c ompliance, see instruction. \nRespo nsibility is:                                         \n☒Essenti al  ☐ Seco ndary \n(Plea se check one) \nTasks involved in fulfilling the above duties/responsibilities (include description for physical and mental/cognitive demands ) \n \n1. Develop and make recommendations for budget proposals for housing operation areas (salary, training, programming, \ntravel, etc.) annually prior to rate development (November 1 annually).  \n2. Work with Director of Finance and Facilities to oversee budget expenditures by all staff within housing operations \nareas.  \n \n \nDocusign Envelope ID: 5BACE92D-4961-41A1-80D8-38189E1D7ACC4 \n  \nDuty/Responsibility  \nNo.      6 Percent \nof Time  \n5% Statement of duty/responsibility (used for evaluation/review of performance) : \n \n \nPlanning and Other Duties  \nFor ADA c ompliance, see instruction. \nRespo nsibility is:                                         \n☒Essenti al  ☐ Seco ndary \n(Plea se check one) \nTasks involved in fulfilling the above duties/responsibilities (include description for physical and mental/cognitive demands ) \n \n1. Contribute and collaborate in departmental assessment and planning initiatives.  \n2. Serve as member of Housing Leadership Team and participate in strategic planning process and in establishing short -\nterm, mid -term, and long -term goals.  \n3. Assist in preparation of Housing annual report as requested.  \n4. Perform related duties as directed or required that promote the goals and objectives of the department, Division, and \nUniversity.  \n5. Serve in on -call duty rotation as requested or scheduled.  \n \n \n \n \nPART B – Required Experience, Characteristics and Ability  \n \n1.  EDU CATION/KN OWLEDGE RE QUIRE MENT - Minimu m education required to perform adequ ately in position could reasonably \nbe attained only by completing the following (if you were to recruit today, what qualification would you require?) \nREQUIRED EDUC ATION/TRAINING  (choose one) \n☐ less than high school diploma \n☐ high school diploma or GED \n \nCOLLEGE LEVEL (choose one) \n☐ 1 year ☐ 2 year ☐ 3 year ☐ 4 year \n☐  Associate’s    ☐  Bachelor ’s \n \n \nGRADUA TE LEVEL  (choose one) \n☐ 1 year ☐ 2 year ☒ post-graduate Major field of study or degree emphasis (accounting, economics, etc...) \n \n   Master’s Degree  \n \n \nSpecialized subject knowledge (cost accounting, MACRO economics, etc.) \n   Student Af fairs Administration, Higher Ed, Leadership, Education , Business \nAdministration, Technology, Public Administration,  or related field  \nMinimum Qualifications:  \n• Master’s degree in Higher Education Administration, Student Affairs, Counseling, or related field.  \n• Two years progressively responsible positions in University residential life and housing administration or related \nfield post -master’s degree.  \n• Three+ years of experience in residential life, student affairs, or related field.  \n• Two+ years supervisory experience  \n \n \n \n   ☒  Valid Driver’s License  \n   ☐  Other License(s) or Certification(s) ____________________________________________________________  \nDocusign Envelope ID: 5BACE92D-4961-41A1-80D8-38189E1D7ACC5 \n  \n \n2. RESP ONSIBILITY F OR DIRECT  SUPERVISI ON OF THE F OLLOWING CLASSIFIED POSITIONS \n \nPosition Number  \nJob Family and  Title of Persons Supervised  \nFTE  \n00013632  Assignment Coordinator, Residence Halls  1 \n00015786  Assignment Coordinator, Apartments  1 \n00024671  Complex Secretary  1 \n00015166  Operations Manager  1 \n  \nTOTAL 4 \n3.  INDIRECT  SUPERVISI ON:                             Total number of classified positions indirectly supe rvised:  \n                          Total number of student employees  or other non-classified employees indirectly supervised:  \n Preferred Qualifications : \n \n• Knowledge and experience using housing assignment software management systems in a college setting  \nincluding assignment process, billing, and creating data reports.  \n• Experience supervising and mentoring student staff.  \n• Flexibility to work evenings, weekends, and respond to emergencies as needed.  \n• Previous experience managing complex administrative and/or  technical systems or processes.  \n• Previous experience developing and presenting training materials and programs.  \n• Five+ years  progressively responsible positions in University residential life and housing administration or \nrelated field.  \n \nCompetencies  required: (i.e. ability to…, demonstrated leadership skills, strong communication skills)  \n• Demonstrated experience with process analysis and improvement.  \n• Knowledge and understanding of applicable regulatory requirements (FERPA, Clery Act, Title IX) . \n• Strong time management  and ability to manage m ultiple projects and priorities.  \n• Demonstrated problem solv ing and process analysis skills.  \n• Excellent verbal, written and interpersonal communication skills . \n• Understanding of student development and best practices in residential education.  \n• Ability to work collaboratively in a diverse and inclusive environment.  \n \n \n \nWork s afety requirements:  \n• Follow safety rules  and promote safe behavior  \n• Help identify unsafe working conditions and notify supervisor or Office of Safety  \n• Ensure the safety policies and procedures are being followed  \n• Report incidents and near misses to supervisor or Office of Safety within 24 hours  \n• Complete all required safety and other mandatory training requirements  \n Work habit requirements:  \n• Attendance and punctuality consistently maintained; follows correct procedures for notification  \n• Use work time appropriately for work activities; attend meetings promptly  \n• Demonstrate flexibility in scheduling and accepting work assignments  \n• Follow procedures for requesting leave and reporting absences; provide necessary documentation/releases  \n• Remain calm, professional, and collegial in all circumstances  \nDocusign Envelope ID: 5BACE92D-4961-41A1-80D8-38189E1D7ACC6 \n  \n4. HAZARDOUS WORKING \nCONDITI ONS  \nUnusu al or hazardous working conditions related to performance of duties: \n \nN/A \n  \nPrecautionary measures taken to avoid those unusual or hazardous working conditions: \n \nN/A \n Frequency of occurrence of unusual or hazardous working conditions: \n \nN/A \n \n \n5.  This position is classified as:               ☒   Exempt                    ☐   Non -Exempt  (eligible for overtime)  \n \nExecutive  \n  ☐   Meets FLSA Salary Requirements                 Administrative  \n  ☒    Meets FLSA Salary Requirements                 Professional  \n ☐    Meets FLSA Salary Requirements                 \n☐Primary duty is management of the \nenterprise or recognized department/ \nsubdivision  \n \n☐Does the employee have the authority \nto hire or fire or provide suggestions/ \nrecommendations to hire, fire, promote or \nchange status of other employees  ☒Primary duty is office/non -manual work \nrelated to management policies/general \nbusiness operations  \n \n☐Work directly related to academic \ninstruction or training  ☐Primary duty is work requiring \nknowledge of advanced type in science \nor learning  \n \n☐Work is original and creative in a field \nof artistic endeavor  \n \n☐Work is teaching in educational \ninstitution  \n \n☐Work requires theoretical/practical \napplication of highly specialized \nknowledge in computer systems \nanalysis, programming and software  \nengineering and employee is employed \nand engaged in these activities  \n☐Customarily and regularly directs the \nwork of two or more other employees  ☒Customarily and regularly exercises \ndiscretion and independent judgment  in \nmatters of consequence  ☐Work requires consistent exercise of \ndiscretion and judgment  \nDocusign Envelope ID: 5BACE92D-4961-41A1-80D8-38189E1D7ACC7 \n  \n \n6.  PHYSIC AL JOB RE QUIREMENTS:  Indicate according to essential duties/responsibilities \nEmployee is required to:  \nNever 1-33% \nOccas ionally 34-66% \nFrequently 66-100% \nContinuou sly \n \nStand   X \n  \n \nWalk   X  \n \nSit   X  \n \nUse hands dexterously (use fingers to handle, feel)   X  \n \nReach with hands and arms   X  \n \nClimb or balance   X  \n \nPulling/Tugging /Twisting    X  \n \nStoop/kneel/crouch or crawl  X   \n \nTalk or hear    X \n \nTaste or smell   X  \n \nLift & carry: up to 10 pounds   X  \n \nup to 25 pounds   X  \n \nup to 50 pounds  X   \n \nup to 75 pounds X    \n \nup to 100 pounds X    \n \nmore than 100 pounds X    \nOther ( Please Explain ):  \n \n \n \nMy signature below indicates I have read and understand the  description of the duties and responsibilities assigned to the \nposition.  I also understand that my supervisor and the institution have  the right to make changes to duties and work \nschedule to meet business needs.  \n \n \n \n \nEmplo yee's Signature Date \n \n \n \n \n \nSupervisor's Signature Date \n \nPLEASE ATTACH A BLACK AND WHITE ORGANIZATIONAL CHART \n \nLast updated 04/20 /2017  \nDocusign Envelope ID: 5BACE92D-4961-41A1-80D8-38189E1D7ACC\n2/3/2025\n2/3/2025\n",
            "system_instruction": "You are a practice partner for a Assistant Director of Operations. Evaluate responses based on their job description and the Guiding North Framework."
        },
        "Front Desk Student Assistant": {
            "description": "Description  \nThis is a part -time, non-benefited position. Only UND students are eligible to be hired in this position.   \nHousing Office Assistants provide support for Housing Office by assisting customers in person, by phone, and email. \nIn addition, the position assists with general office tasks including document scanning, sorting mail, copying, typing, \nand other general of fice duties or projects as assigned . \nDuties & Responsibilities  \n• Demonstrate effective use of interpersonal communication skills by providing excellent customer service.  \n• Demonstrate effective critical thinking skills through problem solving, prioritization, and communication.  \n• Develop effective administrative skills through the completion of daily shift tasks.  \nRequirements & Competencies  \n• Strict attention to confidentiality (FERPA) is essential  \n• Excellent communication skills and dependability are very important  \n• Must have strong attention to detail  \n• Requires knowledge of Microsoft Office software  \n• Requires a valid driver’s license for deliveries and errands  \n• Must be able to lift a minimum of 25 lbs  \n• Preference given to candidates with previous customer service and office experience  \n• Successful completion of criminal history records check  \nWork Location  \n• Housing Office Assistants are expected to work at the Housing Office front desk, 525 Stanford Road, Grand \nForks, ND 58202.  \nHours & Schedule  \n• Starting Compensation: $10.00 / hour ; part -time; non- exempt; non-benefited  \n• Hours per week: 10 - 12 \n• Flexible schedule available  \no Currently seeking to fill 8:00am - 12:30pm shift Monday - Friday  \n• Scheduled to work during our regular business day, Monday – Friday between the hours of 8:00am – \n5:00pm  \n• May be scheduled to work during academic break periods.  \n• Employment opportunities are for immediate start and continuation into Spring 2023 upon demonstration of \ngood job performance and available budget.  \nEmployment Eligiblity  \nThe University of North Dakota determines employment eligibility through the E -Verify system: What is E -Verify? New \nemployees to the University of North Dakota must present specific identification to determine their employment \neligibility no later than their first day of work. To view the identification required, please see the List of Acceptable \nDocuments . You will be required to have one item from List A OR one item from List B and List C.  \nTo Apply  For full consideration, applications must be received by the closing date and include the following materials:  \n• Resume  \nPlease include in application if you are currently or have in the past 12 months been employed with the University of \nNorth Dakota, the North Dakota University System or any other North Dakota State agency. If so, include which \nagency/department, as well a s how many hours you work a week and in the past 12 months.  \nFinal number of openings will depend on applicant availability and spring semester turnover.  \nIf you have any questions, please contact Tara Hughes at tara.hughes@und.edu.   \n ",
            "system_instruction": "You are a practice partner for a Front Desk Student Assistant. Evaluate responses based on their job description and the Guiding North Framework."
        },
        "Assignments Coordinator, Residence Halls": {
            "description": "1 \n \n \n \n \nPOSITI ON DESCR IPTION  \nNorth  Dakota  University System \n \nPART A - Identification, Duties/Respons ibilities, and Task Inventory  \n \n \n   (#’s 1 -12a must match HRMS or left blank and include a Position Request/Change form)  \n \n1. Name of Employee: Mathew Muston   \n1a. EmpID  #: 8013142  \n \n2. Position #:  0001 3639   \n2a. Dept. ID #:  3610   \n2b. Current or Recommended Salary :   $64,500  \n \n3. Band #/Title : 3000: Professional  \n  \n3a. Job Family #/Title: 3415 General Student Services Professional  \n \n4. Functional Title:   Assistant Director  of Housing Operations  \n5. Please check all that apply \n \n5a. Type  of position:   ☒Full time     ☐ Part-time  \nIF Part-Time, FTE Percentage: ______%  \n5b. Length of Position:  ☐  9 month  ☐ 10 month  ☐ 11 month ☒ 12 month  ☐Other Month _____  \n \n6. Institution: University of North  Dakota  \n7. Division:  Student Affair s \n \n8. Department:   Housing  & Residence Life   \n9. Unit: \n \n10. Work Mailing Address: 525 Stanford Road, Grand Forks, ND 58202 -9029   \n11. Work Phone:  701.777. 6366  \n \n12. Name & Title of Supervisor:  Troy Noeldner , Director of Housing  & Residence Life  12a. Supervisor Posn #:   00015789  \n13.  What is the function/mission of your department? \n \nThe Housing Department at the University of North Dakota is a large diverse auxiliary enterprise, whose mission is to deliver ho using \nservices  to the University community in a manner that is congruent with the overall mission of the University.  The department’s goal is \nnot only to meet the needs of a changing student population, but to supplement the academic experience by providing opportuni ties to \nenhance personal growth, develop a positive self -identity an d to interact successfully with others in the college environment.  This \nmission is realized through the careful integration of financial planning, facilities coordination, and development of educat ional student -\noriented programs and services designed to benefit the University community.  The department provides quality services in sup port of \nthe University’s overall mission and is an enthusiastic partner in new campus developments and activities.  The department strives to \nserve as a center of excellence and provide expertise, teamwork, vitality, and innovation for the betterment of the institution.  \n14.  What is the purpose of your position? (Why does the position exist, how does the position function within the work unit?) \n \nReporting to the Director of Housing & Residence Life, the Assistant Director of Housing Operations will provide leadership t o \ndepartmental administrative operations and service delivery. Housing & Residence Life oversees more than 25 residential facil ities \nwhich accommodate approximately 3,000 residential students. As a member of the senior leadership team, the Assistant Director  of \nHousing Operations will work with direct ing the room and apartment assignment processes, move -in/move -out processes, \npolicy/procedure development, housing software initiatives, training/implementation of customer service standards, service ce nter \noperations, mail/package services, housing key manage ment, document retention, assessment, etc. This position will work \ncollaboratively with the Housing staff and contribute to the achievement of departmental goals and priorities.  \n \n15.  Is this position essential during emergencies/closures?     ☐  Yes    ☒   No \n(Essential personnel may be required to work during emergencies and closures affecting UND depe nding on staffing levels required for \nthat particular situation.) \nDocusign Envelope ID: 5BACE92D-4961-41A1-80D8-38189E1D7ACC2 \n PART A - 16.  Duties/Responsibilities \n⇒   Indicate Essential/Secondary.  The following questions should be taken into consideration in the determination: \n- Is the duty/responsibility the reason the job exists? \n-  Is this a highly specialized task or one that requires special education, training, licensure? \nIf the  answer is yes, the duty is “essential”. \n- What is the percentage of time spent on the function? \nIf the  answer ind icates a great % of time, the duty is prob ably “esse ntial”. \n- What are the consequences to others or the institution of a failure to perform the function? \nIf the  answer ind icates a high level of accountability, the duty is “esse ntial”. \n \nNOTE:  See Position Description Instructions and example s. \n \n \nDuty/Responsibility  \nNo.      1 Percent \nof Time  \n30% Statement of duty/responsibility (used for evaluation/review of performance) : \n \n \nOccupancy Management  \nFor ADA c ompliance, see instruction. \nRespo nsibility is:                                         \n☒Essenti al  ☐ Seco ndary \n(Plea se check one) \nTasks involved in fulfilling the above duties/responsibilities (include description for physical and mental/cognitive demands)  \n \n1. Oversee the administration of assignment processes for new and returning students in residence halls and apartments.  \n2. Provide leadership for the department’s housing management software system functions to ensure accuracy and efficiency.   \n3. Coordinate with legal counsel and other housing officials to review all contracts and leases.  \n4. Review, evaluate, and implement  requests for exemptions from housing requirements, assignment changes, and \ncancellation of contracts/leases.  \n5. Coordinate the generation of reports on applications, occupancy, and demographics for internal and external distribution and \nusage as requested.  \n6. Develop and provide oversight of the  comprehensive assignments experience including  marketing and outreach to current \nand prospective residents, application, renewal, assignment, check -in/check -out processes, resident satisfaction and pos t \noccupancy follow up as needed . \n \n \n \n \nDuty/Responsibility  \nNo.      2 Percent \nof Time  \n25% Statement of duty/responsibility (used for evaluation/review of performance) : \n \n \nAdministration  \nFor ADA c ompliance, see instruction. \nRespo nsibility is:                                         \n☒Essenti al  ☐ Seco ndary \n(Plea se check one) \nTasks involved in fulfilling the above duties/responsibilities (include description for physical and mental/cognitive demands)  \n \n1. Communicate regularly with the senior housing leadership regarding duties, assignments,  and responsibilities. Providing \nupdates, seeking clarification or assistance as needed to ensure timely and accurate completion of assigned tasks.  \n2. Demonstrate and apply knowledge of compliance and regulatory requirements related to operations i.e., Fair Housing, \nClery, FERPA, ACA, Title IX, etc.  \n3. Provide oversight of key inventory and Electronic Door Access systems for all on -campus housing facilities year -round  and \nstay informed of new key inventory tracking systems and software.  \n4. Develop and manage processes to meet departmental goal of maximizing use of electronic and on -line service delivery, \nself-service options, recordkeeping, and administrative processes . \n5. Provide leadership for the department’s housing management software system functions. Manage access for new users to \nall Housing software programs; audit processes regularly to ensure access privileges are current and appropriate security \nprotocols are followed to all Housing related software.  \n6. Regularly audit processes and monitor training necessary to safeguard confidentiality and security of records . \n7. Monitor, evaluate and implement changes to operational processes where needed to ensure best practices and high \nstandards of service delivery . \n8. Direct service operations including service centers, desk operations, mail services, etc.  \n9. Assist with planning and execution of opening and closing of all residential units including transition housing, semester \nbreak housing, and summer conferences.  \n10. Annually review polices and propose changes in support of departmental and University goals.  \n11. Propose technology solutions which result in higher operational effectiveness and services to internal and external \ncustomers.  \n \n \n \nDocusign Envelope ID: 5BACE92D-4961-41A1-80D8-38189E1D7ACC3 \n  \n \n \nDuty/Responsibility  \nNo.      3 Percent \nof Time  \n20% Statement of duty/responsibility (used for evaluation/review of performance) : \n \n \nStaffing/Supervision  \nFor ADA c ompliance, see instruction. \nRespo nsibility is:                                         \n☒Essenti al  ☐ Seco ndary \n(Plea se check one) \nTasks involved in fulfilling the above duties/responsibilities (include description for physical and mental/cognitive demands)  \n \n1. Supervise  the recruitment,  selection,  training,  professional development,  and evaluation  of the housing operations  team.  \n2. Ensure training and documentation on application and assignment policies and procedures, and usage of the housing \nmanagement system and other departmental software.  \n3. Ensure Housing end -users receive instruction, information, and training materials for housing management software, \nconduct management software, and other related applications.  \n4. Annually review, update/revise, and execute training programs to remain current and comply with life -safety issues, \nuniversity, and federal guidelines/mand ates.  \n \n \n \n \nDuty/Responsibility  \nNo.      4 Percent \nof Time  \n15% Statement of duty/responsibility (used for evaluation/review of performance) : \n \n \nPublic Relations  \nFor ADA c ompliance, see instruction. \nRespo nsibility is:                                         \n☒Essenti al  ☐ Seco ndary \n(Plea se check one) \nTasks involved in fulfilling the above duties/responsibilities (include description for physical and mental/cognitive demands)  \n \n1. Meet with current and prospective residents as needed to answer questions or resolve issues.  \n2. Work  with supervisor and departmental marketing personnel in communicating important deadlines and related information \nto students, parents,  and other constituents . \n3. Consult with, advise, and interpret University Housing policies and procedures to staff, students, families, and public.  \n4. Greet and maintain high levels of customer services, addressing callers, students, parents, guests, co -workers, and \nUniversity personnel in a friendly and helpful manner . \n5. Follow up with students, parents and others as necessary to resolve assignment related issues . \n6. Maintain working knowledge of campus resources and act as a liaison with other departments and offices.  \n7. Collaborate with other Housing staff members as required, participate as an active and supportive member of the \nDepartment of Housing . \n8. Represent Housing on various campus committees as may be requested or assigned.  \n9. Establish collaborative working relationships with internal and external constituent groups or individuals .  \n10. Maintain professional contacts through ACUHO -I and other professional organizations . \n \n \n \n \nDuty/Responsibility  \nNo.      5 Percent \nof Time  \n5% Statement of duty/responsibility (used for evaluation/review of performance) : \n \n \nBudget and Finance Management  \nFor ADA c ompliance, see instruction. \nRespo nsibility is:                                         \n☒Essenti al  ☐ Seco ndary \n(Plea se check one) \nTasks involved in fulfilling the above duties/responsibilities (include description for physical and mental/cognitive demands ) \n \n1. Develop and make recommendations for budget proposals for housing operation areas (salary, training, programming, \ntravel, etc.) annually prior to rate development (November 1 annually).  \n2. Work with Director of Finance and Facilities to oversee budget expenditures by all staff within housing operations \nareas.  \n \n \nDocusign Envelope ID: 5BACE92D-4961-41A1-80D8-38189E1D7ACC4 \n  \nDuty/Responsibility  \nNo.      6 Percent \nof Time  \n5% Statement of duty/responsibility (used for evaluation/review of performance) : \n \n \nPlanning and Other Duties  \nFor ADA c ompliance, see instruction. \nRespo nsibility is:                                         \n☒Essenti al  ☐ Seco ndary \n(Plea se check one) \nTasks involved in fulfilling the above duties/responsibilities (include description for physical and mental/cognitive demands ) \n \n1. Contribute and collaborate in departmental assessment and planning initiatives.  \n2. Serve as member of Housing Leadership Team and participate in strategic planning process and in establishing short -\nterm, mid -term, and long -term goals.  \n3. Assist in preparation of Housing annual report as requested.  \n4. Perform related duties as directed or required that promote the goals and objectives of the department, Division, and \nUniversity.  \n5. Serve in on -call duty rotation as requested or scheduled.  \n \n \n \n \nPART B – Required Experience, Characteristics and Ability  \n \n1.  EDU CATION/KN OWLEDGE RE QUIRE MENT - Minimu m education required to perform adequ ately in position could reasonably \nbe attained only by completing the following (if you were to recruit today, what qualification would you require?) \nREQUIRED EDUC ATION/TRAINING  (choose one) \n☐ less than high school diploma \n☐ high school diploma or GED \n \nCOLLEGE LEVEL (choose one) \n☐ 1 year ☐ 2 year ☐ 3 year ☐ 4 year \n☐  Associate’s    ☐  Bachelor ’s \n \n \nGRADUA TE LEVEL  (choose one) \n☐ 1 year ☐ 2 year ☒ post-graduate Major field of study or degree emphasis (accounting, economics, etc...) \n \n   Master’s Degree  \n \n \nSpecialized subject knowledge (cost accounting, MACRO economics, etc.) \n   Student Af fairs Administration, Higher Ed, Leadership, Education , Business \nAdministration, Technology, Public Administration,  or related field  \nMinimum Qualifications:  \n• Master’s degree in Higher Education Administration, Student Affairs, Counseling, or related field.  \n• Two years progressively responsible positions in University residential life and housing administration or related \nfield post -master’s degree.  \n• Three+ years of experience in residential life, student affairs, or related field.  \n• Two+ years supervisory experience  \n \n \n \n   ☒  Valid Driver’s License  \n   ☐  Other License(s) or Certification(s) ____________________________________________________________  \nDocusign Envelope ID: 5BACE92D-4961-41A1-80D8-38189E1D7ACC5 \n  \n \n2. RESP ONSIBILITY F OR DIRECT  SUPERVISI ON OF THE F OLLOWING CLASSIFIED POSITIONS \n \nPosition Number  \nJob Family and  Title of Persons Supervised  \nFTE  \n00013632  Assignment Coordinator, Residence Halls  1 \n00015786  Assignment Coordinator, Apartments  1 \n00024671  Complex Secretary  1 \n00015166  Operations Manager  1 \n  \nTOTAL 4 \n3.  INDIRECT  SUPERVISI ON:                             Total number of classified positions indirectly supe rvised:  \n                          Total number of student employees  or other non-classified employees indirectly supervised:  \n Preferred Qualifications : \n \n• Knowledge and experience using housing assignment software management systems in a college setting  \nincluding assignment process, billing, and creating data reports.  \n• Experience supervising and mentoring student staff.  \n• Flexibility to work evenings, weekends, and respond to emergencies as needed.  \n• Previous experience managing complex administrative and/or  technical systems or processes.  \n• Previous experience developing and presenting training materials and programs.  \n• Five+ years  progressively responsible positions in University residential life and housing administration or \nrelated field.  \n \nCompetencies  required: (i.e. ability to…, demonstrated leadership skills, strong communication skills)  \n• Demonstrated experience with process analysis and improvement.  \n• Knowledge and understanding of applicable regulatory requirements (FERPA, Clery Act, Title IX) . \n• Strong time management  and ability to manage m ultiple projects and priorities.  \n• Demonstrated problem solv ing and process analysis skills.  \n• Excellent verbal, written and interpersonal communication skills . \n• Understanding of student development and best practices in residential education.  \n• Ability to work collaboratively in a diverse and inclusive environment.  \n \n \n \nWork s afety requirements:  \n• Follow safety rules  and promote safe behavior  \n• Help identify unsafe working conditions and notify supervisor or Office of Safety  \n• Ensure the safety policies and procedures are being followed  \n• Report incidents and near misses to supervisor or Office of Safety within 24 hours  \n• Complete all required safety and other mandatory training requirements  \n Work habit requirements:  \n• Attendance and punctuality consistently maintained; follows correct procedures for notification  \n• Use work time appropriately for work activities; attend meetings promptly  \n• Demonstrate flexibility in scheduling and accepting work assignments  \n• Follow procedures for requesting leave and reporting absences; provide necessary documentation/releases  \n• Remain calm, professional, and collegial in all circumstances  \nDocusign Envelope ID: 5BACE92D-4961-41A1-80D8-38189E1D7ACC6 \n  \n4. HAZARDOUS WORKING \nCONDITI ONS  \nUnusu al or hazardous working conditions related to performance of duties: \n \nN/A \n  \nPrecautionary measures taken to avoid those unusual or hazardous working conditions: \n \nN/A \n Frequency of occurrence of unusual or hazardous working conditions: \n \nN/A \n \n \n5.  This position is classified as:               ☒   Exempt                    ☐   Non -Exempt  (eligible for overtime)  \n \nExecutive  \n  ☐   Meets FLSA Salary Requirements                 Administrative  \n  ☒    Meets FLSA Salary Requirements                 Professional  \n ☐    Meets FLSA Salary Requirements                 \n☐Primary duty is management of the \nenterprise or recognized department/ \nsubdivision  \n \n☐Does the employee have the authority \nto hire or fire or provide suggestions/ \nrecommendations to hire, fire, promote or \nchange status of other employees  ☒Primary duty is office/non -manual work \nrelated to management policies/general \nbusiness operations  \n \n☐Work directly related to academic \ninstruction or training  ☐Primary duty is work requiring \nknowledge of advanced type in science \nor learning  \n \n☐Work is original and creative in a field \nof artistic endeavor  \n \n☐Work is teaching in educational \ninstitution  \n \n☐Work requires theoretical/practical \napplication of highly specialized \nknowledge in computer systems \nanalysis, programming and software  \nengineering and employee is employed \nand engaged in these activities  \n☐Customarily and regularly directs the \nwork of two or more other employees  ☒Customarily and regularly exercises \ndiscretion and independent judgment  in \nmatters of consequence  ☐Work requires consistent exercise of \ndiscretion and judgment  \nDocusign Envelope ID: 5BACE92D-4961-41A1-80D8-38189E1D7ACC7 \n  \n \n6.  PHYSIC AL JOB RE QUIREMENTS:  Indicate according to essential duties/responsibilities \nEmployee is required to:  \nNever 1-33% \nOccas ionally 34-66% \nFrequently 66-100% \nContinuou sly \n \nStand   X \n  \n \nWalk   X  \n \nSit   X  \n \nUse hands dexterously (use fingers to handle, feel)   X  \n \nReach with hands and arms   X  \n \nClimb or balance   X  \n \nPulling/Tugging /Twisting    X  \n \nStoop/kneel/crouch or crawl  X   \n \nTalk or hear    X \n \nTaste or smell   X  \n \nLift & carry: up to 10 pounds   X  \n \nup to 25 pounds   X  \n \nup to 50 pounds  X   \n \nup to 75 pounds X    \n \nup to 100 pounds X    \n \nmore than 100 pounds X    \nOther ( Please Explain ):  \n \n \n \nMy signature below indicates I have read and understand the  description of the duties and responsibilities assigned to the \nposition.  I also understand that my supervisor and the institution have  the right to make changes to duties and work \nschedule to meet business needs.  \n \n \n \n \nEmplo yee's Signature Date \n \n \n \n \n \nSupervisor's Signature Date \n \nPLEASE ATTACH A BLACK AND WHITE ORGANIZATIONAL CHART \n \nLast updated 04/20 /2017  \nDocusign Envelope ID: 5BACE92D-4961-41A1-80D8-38189E1D7ACC\n2/3/2025\n2/3/2025\n",
            "system_instruction": "You are a practice partner for a Assignments Coordinator, Residence Halls. Evaluate responses based on their job description and the Guiding North Framework."
        },
        "Assignments Coordinator, Apartments": {
            "description": "1 \n \n \n \n \nPOSITI ON DESCR IPTION  \nNorth  Dakota  University System \n \nPART A - Identification, Duties/Respons ibilities, and Task Inventory  \n \n \n   (#’s 1 -12a must match HRMS or left blank and include a Position Request/Change form)  \n \n1. Name of Employee: Mathew Muston   \n1a. EmpID  #: 8013142  \n \n2. Position #:  0001 3639   \n2a. Dept. ID #:  3610   \n2b. Current or Recommended Salary :   $64,500  \n \n3. Band #/Title : 3000: Professional  \n  \n3a. Job Family #/Title: 3415 General Student Services Professional  \n \n4. Functional Title:   Assistant Director  of Housing Operations  \n5. Please check all that apply \n \n5a. Type  of position:   ☒Full time     ☐ Part-time  \nIF Part-Time, FTE Percentage: ______%  \n5b. Length of Position:  ☐  9 month  ☐ 10 month  ☐ 11 month ☒ 12 month  ☐Other Month _____  \n \n6. Institution: University of North  Dakota  \n7. Division:  Student Affair s \n \n8. Department:   Housing  & Residence Life   \n9. Unit: \n \n10. Work Mailing Address: 525 Stanford Road, Grand Forks, ND 58202 -9029   \n11. Work Phone:  701.777. 6366  \n \n12. Name & Title of Supervisor:  Troy Noeldner , Director of Housing  & Residence Life  12a. Supervisor Posn #:   00015789  \n13.  What is the function/mission of your department? \n \nThe Housing Department at the University of North Dakota is a large diverse auxiliary enterprise, whose mission is to deliver ho using \nservices  to the University community in a manner that is congruent with the overall mission of the University.  The department’s goal is \nnot only to meet the needs of a changing student population, but to supplement the academic experience by providing opportuni ties to \nenhance personal growth, develop a positive self -identity an d to interact successfully with others in the college environment.  This \nmission is realized through the careful integration of financial planning, facilities coordination, and development of educat ional student -\noriented programs and services designed to benefit the University community.  The department provides quality services in sup port of \nthe University’s overall mission and is an enthusiastic partner in new campus developments and activities.  The department strives to \nserve as a center of excellence and provide expertise, teamwork, vitality, and innovation for the betterment of the institution.  \n14.  What is the purpose of your position? (Why does the position exist, how does the position function within the work unit?) \n \nReporting to the Director of Housing & Residence Life, the Assistant Director of Housing Operations will provide leadership t o \ndepartmental administrative operations and service delivery. Housing & Residence Life oversees more than 25 residential facil ities \nwhich accommodate approximately 3,000 residential students. As a member of the senior leadership team, the Assistant Director  of \nHousing Operations will work with direct ing the room and apartment assignment processes, move -in/move -out processes, \npolicy/procedure development, housing software initiatives, training/implementation of customer service standards, service ce nter \noperations, mail/package services, housing key manage ment, document retention, assessment, etc. This position will work \ncollaboratively with the Housing staff and contribute to the achievement of departmental goals and priorities.  \n \n15.  Is this position essential during emergencies/closures?     ☐  Yes    ☒   No \n(Essential personnel may be required to work during emergencies and closures affecting UND depe nding on staffing levels required for \nthat particular situation.) \nDocusign Envelope ID: 5BACE92D-4961-41A1-80D8-38189E1D7ACC2 \n PART A - 16.  Duties/Responsibilities \n⇒   Indicate Essential/Secondary.  The following questions should be taken into consideration in the determination: \n- Is the duty/responsibility the reason the job exists? \n-  Is this a highly specialized task or one that requires special education, training, licensure? \nIf the  answer is yes, the duty is “essential”. \n- What is the percentage of time spent on the function? \nIf the  answer ind icates a great % of time, the duty is prob ably “esse ntial”. \n- What are the consequences to others or the institution of a failure to perform the function? \nIf the  answer ind icates a high level of accountability, the duty is “esse ntial”. \n \nNOTE:  See Position Description Instructions and example s. \n \n \nDuty/Responsibility  \nNo.      1 Percent \nof Time  \n30% Statement of duty/responsibility (used for evaluation/review of performance) : \n \n \nOccupancy Management  \nFor ADA c ompliance, see instruction. \nRespo nsibility is:                                         \n☒Essenti al  ☐ Seco ndary \n(Plea se check one) \nTasks involved in fulfilling the above duties/responsibilities (include description for physical and mental/cognitive demands)  \n \n1. Oversee the administration of assignment processes for new and returning students in residence halls and apartments.  \n2. Provide leadership for the department’s housing management software system functions to ensure accuracy and efficiency.   \n3. Coordinate with legal counsel and other housing officials to review all contracts and leases.  \n4. Review, evaluate, and implement  requests for exemptions from housing requirements, assignment changes, and \ncancellation of contracts/leases.  \n5. Coordinate the generation of reports on applications, occupancy, and demographics for internal and external distribution and \nusage as requested.  \n6. Develop and provide oversight of the  comprehensive assignments experience including  marketing and outreach to current \nand prospective residents, application, renewal, assignment, check -in/check -out processes, resident satisfaction and pos t \noccupancy follow up as needed . \n \n \n \n \nDuty/Responsibility  \nNo.      2 Percent \nof Time  \n25% Statement of duty/responsibility (used for evaluation/review of performance) : \n \n \nAdministration  \nFor ADA c ompliance, see instruction. \nRespo nsibility is:                                         \n☒Essenti al  ☐ Seco ndary \n(Plea se check one) \nTasks involved in fulfilling the above duties/responsibilities (include description for physical and mental/cognitive demands)  \n \n1. Communicate regularly with the senior housing leadership regarding duties, assignments,  and responsibilities. Providing \nupdates, seeking clarification or assistance as needed to ensure timely and accurate completion of assigned tasks.  \n2. Demonstrate and apply knowledge of compliance and regulatory requirements related to operations i.e., Fair Housing, \nClery, FERPA, ACA, Title IX, etc.  \n3. Provide oversight of key inventory and Electronic Door Access systems for all on -campus housing facilities year -round  and \nstay informed of new key inventory tracking systems and software.  \n4. Develop and manage processes to meet departmental goal of maximizing use of electronic and on -line service delivery, \nself-service options, recordkeeping, and administrative processes . \n5. Provide leadership for the department’s housing management software system functions. Manage access for new users to \nall Housing software programs; audit processes regularly to ensure access privileges are current and appropriate security \nprotocols are followed to all Housing related software.  \n6. Regularly audit processes and monitor training necessary to safeguard confidentiality and security of records . \n7. Monitor, evaluate and implement changes to operational processes where needed to ensure best practices and high \nstandards of service delivery . \n8. Direct service operations including service centers, desk operations, mail services, etc.  \n9. Assist with planning and execution of opening and closing of all residential units including transition housing, semester \nbreak housing, and summer conferences.  \n10. Annually review polices and propose changes in support of departmental and University goals.  \n11. Propose technology solutions which result in higher operational effectiveness and services to internal and external \ncustomers.  \n \n \n \nDocusign Envelope ID: 5BACE92D-4961-41A1-80D8-38189E1D7ACC3 \n  \n \n \nDuty/Responsibility  \nNo.      3 Percent \nof Time  \n20% Statement of duty/responsibility (used for evaluation/review of performance) : \n \n \nStaffing/Supervision  \nFor ADA c ompliance, see instruction. \nRespo nsibility is:                                         \n☒Essenti al  ☐ Seco ndary \n(Plea se check one) \nTasks involved in fulfilling the above duties/responsibilities (include description for physical and mental/cognitive demands)  \n \n1. Supervise  the recruitment,  selection,  training,  professional development,  and evaluation  of the housing operations  team.  \n2. Ensure training and documentation on application and assignment policies and procedures, and usage of the housing \nmanagement system and other departmental software.  \n3. Ensure Housing end -users receive instruction, information, and training materials for housing management software, \nconduct management software, and other related applications.  \n4. Annually review, update/revise, and execute training programs to remain current and comply with life -safety issues, \nuniversity, and federal guidelines/mand ates.  \n \n \n \n \nDuty/Responsibility  \nNo.      4 Percent \nof Time  \n15% Statement of duty/responsibility (used for evaluation/review of performance) : \n \n \nPublic Relations  \nFor ADA c ompliance, see instruction. \nRespo nsibility is:                                         \n☒Essenti al  ☐ Seco ndary \n(Plea se check one) \nTasks involved in fulfilling the above duties/responsibilities (include description for physical and mental/cognitive demands)  \n \n1. Meet with current and prospective residents as needed to answer questions or resolve issues.  \n2. Work  with supervisor and departmental marketing personnel in communicating important deadlines and related information \nto students, parents,  and other constituents . \n3. Consult with, advise, and interpret University Housing policies and procedures to staff, students, families, and public.  \n4. Greet and maintain high levels of customer services, addressing callers, students, parents, guests, co -workers, and \nUniversity personnel in a friendly and helpful manner . \n5. Follow up with students, parents and others as necessary to resolve assignment related issues . \n6. Maintain working knowledge of campus resources and act as a liaison with other departments and offices.  \n7. Collaborate with other Housing staff members as required, participate as an active and supportive member of the \nDepartment of Housing . \n8. Represent Housing on various campus committees as may be requested or assigned.  \n9. Establish collaborative working relationships with internal and external constituent groups or individuals .  \n10. Maintain professional contacts through ACUHO -I and other professional organizations . \n \n \n \n \nDuty/Responsibility  \nNo.      5 Percent \nof Time  \n5% Statement of duty/responsibility (used for evaluation/review of performance) : \n \n \nBudget and Finance Management  \nFor ADA c ompliance, see instruction. \nRespo nsibility is:                                         \n☒Essenti al  ☐ Seco ndary \n(Plea se check one) \nTasks involved in fulfilling the above duties/responsibilities (include description for physical and mental/cognitive demands ) \n \n1. Develop and make recommendations for budget proposals for housing operation areas (salary, training, programming, \ntravel, etc.) annually prior to rate development (November 1 annually).  \n2. Work with Director of Finance and Facilities to oversee budget expenditures by all staff within housing operations \nareas.  \n \n \nDocusign Envelope ID: 5BACE92D-4961-41A1-80D8-38189E1D7ACC4 \n  \nDuty/Responsibility  \nNo.      6 Percent \nof Time  \n5% Statement of duty/responsibility (used for evaluation/review of performance) : \n \n \nPlanning and Other Duties  \nFor ADA c ompliance, see instruction. \nRespo nsibility is:                                         \n☒Essenti al  ☐ Seco ndary \n(Plea se check one) \nTasks involved in fulfilling the above duties/responsibilities (include description for physical and mental/cognitive demands ) \n \n1. Contribute and collaborate in departmental assessment and planning initiatives.  \n2. Serve as member of Housing Leadership Team and participate in strategic planning process and in establishing short -\nterm, mid -term, and long -term goals.  \n3. Assist in preparation of Housing annual report as requested.  \n4. Perform related duties as directed or required that promote the goals and objectives of the department, Division, and \nUniversity.  \n5. Serve in on -call duty rotation as requested or scheduled.  \n \n \n \n \nPART B – Required Experience, Characteristics and Ability  \n \n1.  EDU CATION/KN OWLEDGE RE QUIRE MENT - Minimu m education required to perform adequ ately in position could reasonably \nbe attained only by completing the following (if you were to recruit today, what qualification would you require?) \nREQUIRED EDUC ATION/TRAINING  (choose one) \n☐ less than high school diploma \n☐ high school diploma or GED \n \nCOLLEGE LEVEL (choose one) \n☐ 1 year ☐ 2 year ☐ 3 year ☐ 4 year \n☐  Associate’s    ☐  Bachelor ’s \n \n \nGRADUA TE LEVEL  (choose one) \n☐ 1 year ☐ 2 year ☒ post-graduate Major field of study or degree emphasis (accounting, economics, etc...) \n \n   Master’s Degree  \n \n \nSpecialized subject knowledge (cost accounting, MACRO economics, etc.) \n   Student Af fairs Administration, Higher Ed, Leadership, Education , Business \nAdministration, Technology, Public Administration,  or related field  \nMinimum Qualifications:  \n• Master’s degree in Higher Education Administration, Student Affairs, Counseling, or related field.  \n• Two years progressively responsible positions in University residential life and housing administration or related \nfield post -master’s degree.  \n• Three+ years of experience in residential life, student affairs, or related field.  \n• Two+ years supervisory experience  \n \n \n \n   ☒  Valid Driver’s License  \n   ☐  Other License(s) or Certification(s) ____________________________________________________________  \nDocusign Envelope ID: 5BACE92D-4961-41A1-80D8-38189E1D7ACC5 \n  \n \n2. RESP ONSIBILITY F OR DIRECT  SUPERVISI ON OF THE F OLLOWING CLASSIFIED POSITIONS \n \nPosition Number  \nJob Family and  Title of Persons Supervised  \nFTE  \n00013632  Assignment Coordinator, Residence Halls  1 \n00015786  Assignment Coordinator, Apartments  1 \n00024671  Complex Secretary  1 \n00015166  Operations Manager  1 \n  \nTOTAL 4 \n3.  INDIRECT  SUPERVISI ON:                             Total number of classified positions indirectly supe rvised:  \n                          Total number of student employees  or other non-classified employees indirectly supervised:  \n Preferred Qualifications : \n \n• Knowledge and experience using housing assignment software management systems in a college setting  \nincluding assignment process, billing, and creating data reports.  \n• Experience supervising and mentoring student staff.  \n• Flexibility to work evenings, weekends, and respond to emergencies as needed.  \n• Previous experience managing complex administrative and/or  technical systems or processes.  \n• Previous experience developing and presenting training materials and programs.  \n• Five+ years  progressively responsible positions in University residential life and housing administration or \nrelated field.  \n \nCompetencies  required: (i.e. ability to…, demonstrated leadership skills, strong communication skills)  \n• Demonstrated experience with process analysis and improvement.  \n• Knowledge and understanding of applicable regulatory requirements (FERPA, Clery Act, Title IX) . \n• Strong time management  and ability to manage m ultiple projects and priorities.  \n• Demonstrated problem solv ing and process analysis skills.  \n• Excellent verbal, written and interpersonal communication skills . \n• Understanding of student development and best practices in residential education.  \n• Ability to work collaboratively in a diverse and inclusive environment.  \n \n \n \nWork s afety requirements:  \n• Follow safety rules  and promote safe behavior  \n• Help identify unsafe working conditions and notify supervisor or Office of Safety  \n• Ensure the safety policies and procedures are being followed  \n• Report incidents and near misses to supervisor or Office of Safety within 24 hours  \n• Complete all required safety and other mandatory training requirements  \n Work habit requirements:  \n• Attendance and punctuality consistently maintained; follows correct procedures for notification  \n• Use work time appropriately for work activities; attend meetings promptly  \n• Demonstrate flexibility in scheduling and accepting work assignments  \n• Follow procedures for requesting leave and reporting absences; provide necessary documentation/releases  \n• Remain calm, professional, and collegial in all circumstances  \nDocusign Envelope ID: 5BACE92D-4961-41A1-80D8-38189E1D7ACC6 \n  \n4. HAZARDOUS WORKING \nCONDITI ONS  \nUnusu al or hazardous working conditions related to performance of duties: \n \nN/A \n  \nPrecautionary measures taken to avoid those unusual or hazardous working conditions: \n \nN/A \n Frequency of occurrence of unusual or hazardous working conditions: \n \nN/A \n \n \n5.  This position is classified as:               ☒   Exempt                    ☐   Non -Exempt  (eligible for overtime)  \n \nExecutive  \n  ☐   Meets FLSA Salary Requirements                 Administrative  \n  ☒    Meets FLSA Salary Requirements                 Professional  \n ☐    Meets FLSA Salary Requirements                 \n☐Primary duty is management of the \nenterprise or recognized department/ \nsubdivision  \n \n☐Does the employee have the authority \nto hire or fire or provide suggestions/ \nrecommendations to hire, fire, promote or \nchange status of other employees  ☒Primary duty is office/non -manual work \nrelated to management policies/general \nbusiness operations  \n \n☐Work directly related to academic \ninstruction or training  ☐Primary duty is work requiring \nknowledge of advanced type in science \nor learning  \n \n☐Work is original and creative in a field \nof artistic endeavor  \n \n☐Work is teaching in educational \ninstitution  \n \n☐Work requires theoretical/practical \napplication of highly specialized \nknowledge in computer systems \nanalysis, programming and software  \nengineering and employee is employed \nand engaged in these activities  \n☐Customarily and regularly directs the \nwork of two or more other employees  ☒Customarily and regularly exercises \ndiscretion and independent judgment  in \nmatters of consequence  ☐Work requires consistent exercise of \ndiscretion and judgment  \nDocusign Envelope ID: 5BACE92D-4961-41A1-80D8-38189E1D7ACC7 \n  \n \n6.  PHYSIC AL JOB RE QUIREMENTS:  Indicate according to essential duties/responsibilities \nEmployee is required to:  \nNever 1-33% \nOccas ionally 34-66% \nFrequently 66-100% \nContinuou sly \n \nStand   X \n  \n \nWalk   X  \n \nSit   X  \n \nUse hands dexterously (use fingers to handle, feel)   X  \n \nReach with hands and arms   X  \n \nClimb or balance   X  \n \nPulling/Tugging /Twisting    X  \n \nStoop/kneel/crouch or crawl  X   \n \nTalk or hear    X \n \nTaste or smell   X  \n \nLift & carry: up to 10 pounds   X  \n \nup to 25 pounds   X  \n \nup to 50 pounds  X   \n \nup to 75 pounds X    \n \nup to 100 pounds X    \n \nmore than 100 pounds X    \nOther ( Please Explain ):  \n \n \n \nMy signature below indicates I have read and understand the  description of the duties and responsibilities assigned to the \nposition.  I also understand that my supervisor and the institution have  the right to make changes to duties and work \nschedule to meet business needs.  \n \n \n \n \nEmplo yee's Signature Date \n \n \n \n \n \nSupervisor's Signature Date \n \nPLEASE ATTACH A BLACK AND WHITE ORGANIZATIONAL CHART \n \nLast updated 04/20 /2017  \nDocusign Envelope ID: 5BACE92D-4961-41A1-80D8-38189E1D7ACC\n2/3/2025\n2/3/2025\n",
            "system_instruction": "You are a practice partner for a Assignments Coordinator, Apartments. Evaluate responses based on their job description and the Guiding North Framework."
        },
        "Operations Manager": {
            "description": "Oversees housing operations including assignment processes, facilities management, housing software systems, and general administrative duties.",
            "system_instruction": "You are a practice partner for an Operations Manager. Evaluate responses based on their job description and the Guiding North Framework."
        },
        "Apt RD": {
            "description": "Resident Director for apartment communities. Provides leadership for apartment residents, oversees community development, staff supervision, and residential programming.",
            "system_instruction": "You are a practice partner for an Apartment Resident Director. Evaluate responses based on their job description and the Guiding North Framework."
        }
    },
    "operational_context_default": "- All interactions must be logged in the system within 24 hours.\n- Immediate safety concerns must be escalated to the on-call supervisor.\n- Staff are expected to use strengths-based language at all times.",
    "org_chart": {
        "nodes": [
            "Resident Assistant",
            "Resident Director",
            "Director of Housing & Residence Life",
            "Associate Director of Residence Life",
            "Assistant Director of Operations",
            "Front Desk Student Assistant",
            "Assignments Coordinator, Residence Halls",
            "Assignments Coordinator, Apartments",
            "Operations Manager",
            "Apt RD"
        ],
        "edges": [
            {
                "source": "Resident Assistant",
                "target": "Resident Director"
            },
            {
                "source": "Associate Director of Residence Life",
                "target": "Director of Housing & Residence Life"
            },
            {
                "source": "Assistant Director of Operations",
                "target": "Director of Housing & Residence Life"
            },
            {
                "source": "Resident Director",
                "target": "Associate Director of Residence Life"
            },
            {
                "source": "Front Desk Student Assistant",
                "target": "Assignments Coordinator, Residence Halls"
            },
            {
                "source": "Assignments Coordinator, Residence Halls",
                "target": "Assistant Director of Operations"
            },
            {
                "source": "Assignments Coordinator, Apartments",
                "target": "Assistant Director of Operations"
            },
            {
                "source": "Operations Manager",
                "target": "Assistant Director of Operations"
            },
            {
                "source": "Apt RD",
                "target": "Associate Director of Residence Life"
            }
        ]
    }
}